import time

import paddleocr
import linora as la
from fuzzywuzzy import fuzz

__all__ = ['OCRYinHangKa']


class OCRYinHangKa():
    def __init__(self, model=True, name_list=None):
        if model==True:
            self._model = paddleocr.PaddleOCR(show_log=False)
        elif model:
            self._model = model
        else:
            self._model = None
        self._keys = ['bank_name', 'bank_number', 'bank_type']
        if name_list is None:
            name_list = self._keys.copy()
        else:
            for i in name_list:
                if i not in self._keys:
                    raise ValueError(f'Variable name `{i}`  does not conform to the specification.')
        self._name_list = name_list
        self._char_direction = [
            '中国', '银行', '银联', '借记', '记卡', '信用', '储蓄', '章程', '热线', '签名', '持卡人', '客户', '服务', 
            '使用', '客服', '一卡通', '办理', '电话', '网上', '出租', '转借', '转让', '结算', '闪付', 
            'ATM', 'Bank', 'China', 'Union', 'Pay', 'Quick', 'Pass', 'THRU', 'VALID', 'MONTH', 'YEAR',
            '交通', '工商', '招商', '建设', '农业', '农商', '光大', '邮政', '浦发', '平安', '广发', '中信', '民生',
            '华夏', '兴业', '622']
        self._char_bank_name = [ 
            '中国银行', '中国工商银行', '中国农业银行', '中国建设银行', '交通银行', '中国邮政储蓄银行', 
            
            '中信银行', '中国光大银行', '招商银行', '浦发银行', '民生银行', '华夏银行', '平安银行', 
            '兴业银行', '广发银行', '渤海银行', '浙商银行', '恒丰银行', 
            
            '北京银行', '天津银行', '河北银行', '张家口银行', '承德银行', '秦皇岛银行', '唐山银行', '廊坊银行', '保定银行', 
            '沧州银行', '衡水银行', '邢台银行', '邯郸银行', '晋商银行', '大同银行', '晋城银行', '晋中银行', '阳泉商业银行', 
            '长治银行', '包商银行', '内蒙古银行', '鄂尔多斯银行', '乌海银行', '盛京银行', '鞍山银行', '抚顺银行', '本溪商业银行', 
            '丹东银行', '锦州银行', '营口银行', '营口沿海银行', '阜新银行', '辽阳银行', '铁岭银行', '朝阳银行', '盘锦银行', 
            '葫芦岛银行', '大连银行', '吉林银行', '龙江银行', '哈尔滨银行', '上海银行', '江苏银行', '南京银行', '长江商业银行', 
            '苏州银行', '杭州银行', '温州银行', '嘉兴银行', '湖州银行', '绍兴银行', '金华银行', '浙江稠州商业银行', '台州银行', 
            '浙江泰隆商业银行', '浙江民泰商业银行', '宁波银行', '宁波东海银行', '宁波通商银行', '徽商银行', '福建海峡银行', 
            '泉州银行', '厦门银行', '厦门国际银行', '江西银行', '九江银行', '赣州银行', '上饶银行', '齐鲁银行', '齐商银行', 
            '烟台银行', '潍坊银行', '临商银行', '威海商业银行', '日照银行', '德州银行', '莱商银行', '东营银行', '济宁银行', 
            '泰安银行', '枣庄银行', '青岛银行', '中原银行', '郑州银行', '洛阳银行', '平顶山银行', '焦作中旅银行', '湖北银行', 
            '汉口银行', '长沙银行', '华融湘江银行', '广州银行', '珠海华润银行', '东莞银行', '广东华兴银行', '广东南粤银行', 
            '广西北部湾银行', '柳州银行', '桂林银行', '海南银行', '重庆银行', '重庆三峡银行', '成都银行', '泸州商业银行', 
            '攀枝花商业银行', '宜宾商业银行', '乐山商业银行', '四川天府银行', '自贡银行', '遂宁银行', '绵阳商业银行', 
            '凉山商业银行', '雅安商业银行', '达州银行', '长城华西银行', '贵州银行', '贵阳银行', '富滇银行', '曲靖商业银行', 
            '云南红塔银行', '西藏银行', '长安银行', '西安银行', '兰州银行', '甘肃银行', '青海银行', '宁夏银行', '石嘴山银行', 
            '新疆银行', '乌鲁木齐银行', '昆仑银行', '新疆汇和银行', '库尔勒银行', '哈密商业银行',
            
            '浙江网商银行', '温州民商银行', '武汉众邦银行', '福建华通银行', '威海蓝海银行', '天津金城银行', '上海华瑞银行', 
            '深圳前海微众银行', '湖南三湘银行', '重庆富民银行', '四川新网银行', '北京中关村银行', '吉林亿联银行', '江苏苏宁银行', 
            '梅州客商银行', '安徽新安银行', '辽宁振兴银行', '江西裕民银行',
            
            '石家庄汇融农村合作银行', '广西百色右江农村合作银行', '锡林浩特农村合作银行', '广西平果农村合作银行', '二连浩特农村合作银行', 
            '广西象州农村合作银行', '通辽奈曼农村合作银行', '广西来宾桂中农村合作银行', '广西柳江农村合作银行', '广西贺州桂东农村合作银行', 
            '广西柳城农村合作银行', '昆明官渡农村合作银行', '广西兴安农村合作银行', '陕西富县农村合作银行', '广西阳朔农村合作银行', 
            '陕西吴起农村合作银行', '广西平乐农村合作银行', '甘肃榆中农村合作银行', '广西荔浦农村合作银行', '天水秦州农村合作银行', 
            '广西桂林漓江农村合作银行', '天水麦积农村合作银行', '广西永福农村合作银行', '甘肃宁县农村合作银行', '广西全州农村合作银行', 
            '陇南武都农村合作银行', '广西宜州农村合作银行', '新疆石河子农村合作银行',
            
            '汇丰银行', '星展银行', '摩根士丹利国际银行', '东亚银行', '瑞穗银行', '德意志银行', '南洋商业银行',  '三井住友银行', 
            '瑞士银行', '恒生银行', '三菱日联银行', '花旗银行', '首都银行', '摩根大通银行', '大新银行', '新联商业银行', '华美银行', 
            '华侨永亨银行', '盘谷银行', '蒙特利尔银行', '华商银行', '正信银行', '富邦华一银行', '韩亚银行', '永丰银行', 
            '浦发硅谷银行', '新韩银行', '玉ft银行', '开泰银行', '友利银行', '澳大利亚和新西兰银行', '彰银商业银行', '国民银行', 
            '法国巴黎银行', '国泰世华银行', '企业银行', '法国兴业银行', '渣打银行', '大华银行', '东方汇理银行',
        ]
        nongshangyinhang = '万载,商南,宜黄,山阳,东乡,丹凤,黎川,韩城,南丰,杨凌,乐安,彬州,广昌,金溪,咸阳秦都,咸阳渭城,南城,长武,崇仁,洛川,资溪,延安,抚州,安塞,上饶,甘泉,婺源,子长,玉山,神木,德兴,横山,弋阳,绥德,余干,靖边,万年,吴堡,铅山,佳县,横峰,清涧,广丰,子洲,广信,米脂,鄱阳,定边,临沂兰山,临沂河东,临沂罗庄,兰州,嘉峪关,酒泉,郯城,敦煌,兰陵,瓜州,莒南,玉门,沂水,张掖,蒙阴,临泽,平邑,高台,费县,民乐,沂南,山丹,临沭,金昌,潍坊,永昌,青州,古浪,临朐,民勤,高密,天祝,诸城,武威,昌邑,会宁,安丘,靖远,寿光,定西,昌乐,临洮,济宁,陇西,济宁兖州,岷县,曲阜,秦安,泗水,平凉,邹城,泾川,微山,灵台,鱼台,华亭,金乡,庄浪,嘉祥,静宁,汶上,崇信,梁山,庆阳,枣庄,礼县,滕州,西和,德州,康县,禹城,两当,宁津,临夏,庆云,西宁,乐陵,大通,武城,湟中,临邑,湟源,夏津,海东平安,齐河,互助,平原,民和,德州陵城,循化,莱芜,化隆,东营,海晏,广饶,刚察,垦利,门源,利津,祁连,菏泽,共和,曹县,贵德,定陶,贵南,成武,同德,单县,兴海,巨野,郓城,格尔木,柴达木,鄄城,都兰,东明,乌兰,威海,天峻,荣成,天峻,文登,乳山,泽库,莱州,尖扎,蓬莱,果洛,长岛,玉树,海阳,黄河,龙口,贺兰,莱阳,灵武,招远,平罗,栖霞,石嘴山,烟台,吴忠,临淄,同心,张店,盐池,周村,中卫,高青,中宁,桓台,海原,淄博淄川,固原,沂源,西吉,淄博博山,彭阳,惠民,泾源,阳信,阿克苏,无棣,博湖,博兴,尉犁,邹平,北屯,滨州,奇台,日照东港,呼图壁,日照岚山,塔城,莒县,天山,五莲,沙湾,聊城润昌,博乐,聊城,喀什,东阿,伊犁,茌平,昌吉,临清,库尔勒,高唐,乌苏,莘县,乌鲁木齐,阳谷,伊宁,泰安泰山,阜康,泰安岱岳,木垒,新泰,温宿,肥城,宁阳,阿勒泰,吉木萨尔,东平,轮台,济南,霍城,章丘,富蕴,济阳,昭苏,商河,大连,平阴,宁波奉化,伊川,宁波慈溪,新县,宁波宁海,罗山,宁波余姚,三门峡湖滨,宁波镇海,商丘华商,宁波鄞州,济源,宁波北仑,平顶山卫东,厦门,修武,青岛,孟州,深圳,北京,辉县,天津,渑池,天津滨海,确山,井陉,卢氏,正定,鄢陵,晋州,台前,辛集,新郑,平山,固始,元氏,汴京,灵寿,汝州,石家庄鹿泉,许昌许都,张家口,西峡,怀来,登封,张北,正阳,沽源,汝阳,涿鹿,安阳商都,阳原,中牟,宽城,鹤壁,滦平,宜阳,围场,荥阳,丰宁,兰考,承德热河,卢龙,舞钢,宝丰,滦州,长葛,滦南,洛宁,迁安,桐柏,玉田,西平,唐山曹妃甸,汤阴,唐山,义马,永清,新密,三河,栾川,固安,偃师,霸州,孟津,香河,巩义,文安,获嘉,大厂,永城,蠡州北银,新安,定州,洛阳,高碑店,嵩县,涞水,武陟,涿州,开封宋都,保定,焦作解放,安国,范县,沧州,南皮,新乡平原,安阳相州,献县,遂平,黄骅,驻马店,衡水,叶县,阜城,太康,武强,商水,景州,尉氏,冀州,通许,安平,杞县,深州,三门峡陕州,枣强,浚县,邢台,上蔡,沙河,襄城,清河,滑县,南和,邓州,临城,民权,宁晋,许昌,临西,新蔡,任县,沈丘,广宗,淮滨,巨鹿,鹿邑,柏乡,内乡,邢州,延津,涉县,原阳,邯郸,长垣,大名,沁阳,鸡泽,博爱,阳曲,周口,古交,柘城,清徐,扶沟,大同,清丰,左云,南乐,灵丘,南召,朔州,社旗,山阴,光山,怀仁,息县,右玉,濮阳,忻州,汝南,五台,泌阳,原平,项城,繁峙,镇平,宁武,潢川,静乐,平舆,神池,郑州,五寨,灵宝,岢岚,新野,河曲,淅川,保德,武汉,榆社,黄石,左权,大冶,和顺,阳新,昔阳,十堰,寿阳,竹溪,榆次,郧县,太谷,郧西,平遥,房县,介休,竹山,灵石,晋中开发区,丹江口,武当山,柳林,荆州,孝义,江陵,交城,洪湖,兴县,松滋,孟县,石首,阳泉,公安,壶关,监利,长治潞州,三峡,屯留,远安,武乡,长阳,潞城,秭归,平顺,枝江,襄垣,当阳,黎城,宜都,长子,五峰,沁县,兴山,沁源,鄂州,长治漳泽,荆门,长治黎都,京山,尧都,沙洋,侯马,钟祥,曲沃,襄阳,襄汾,老河口,洪洞,枣阳,安泽,南漳,浮山,谷城,乡宁,保康,永和,宜城,隰县,孝感,晋城,云梦,沁水,大悟,阳城,孝昌,泽州,应城,高平,安陆,岚县,汉川,运城,黄冈,永济,武穴,芮城,团风,临猗,蕲春,稷山,英山,河津,红安,闻喜,罗田,夏县,麻城,绛县,浠水,平陆,黄梅,垣曲,咸宁,万荣,通山,新绛,崇阳,大宁,赤壁,满洲里,嘉鱼,呼伦贝尔,通城,赤峰元宝山,陕坝,恩施,利川,鄂尔多斯,巴东,阿拉善,宣恩,巴彦淖尔河套,伊金霍洛,托克托,鹤峰,来凤,建始,赤峰松山,随州,乌拉特,鄂托克,太仆寺,五原,呼和浩特金谷,广水,仙桃,天门,潜江,神农架,包头,咸丰,宁城,西乌珠穆沁,株洲,株洲珠江,乌兰察布,察哈尔右翼前旗,鄂伦春,土默特右旗,阿尔山,牙克石,阿鲁科尔沁,克什克腾,鄂托克前旗,林西,鄂温克,炎陵,醴陵,茶陵,攸县,湘潭,韶山,湘乡,湘潭天易,桃江,南县,安化,沈阳,益阳,新民,沅江,鞍山,海城,衡阳衡州,衡阳,岫岩,衡南,新宾,衡山,沈抚,衡东,清原,南岳,本溪南芬,耒阳,桓仁,常宁,沈本,祁东,丹东,临武,东港,宜章,凤城,资兴,宽甸,永兴,锦州,嘉禾,磐安,绵竹,兰溪,罗江,衢州柯城,衢州衢江,广安,武胜,龙游,华茎,江山,邻水,常山,广安思源,开化,岳池,台州椒江,台州黄岩,台州路桥,苍溪,青川,剑阁,温岭,广元,玉环,乐山三江,临海,犍为,天台,峨眉山,三门,凉山,仙居,泸州,丽水莲都,泸县,青田,合江,松阳,叙永,龙泉,古蔺,遂昌,眉山,缙云,青神,庆元,仁寿,云和,丹棱,景宁,三台,舟山定海海洋,舟山普陀,安州,平武,岱山,梓潼,嵊泗,内江,绍兴恒信,威远,合肥科技,隆昌,潜山,南充,望江,营山,安庆,仪陇,岳西,阆中,宿松,南部,怀宁,西充,桐城,攀枝花,太湖,大英,蚌埠,蓬溪,怀远,射洪,五河,遂宁,固镇,雅安,毫州药都,宜宾,利辛,宜宾金江,蒙城,江安,涡阳,长宁竹海,肥西,高县,巢湖,筠连,长丰,珙县,庐江,兴文石海,肥东,屏山,池州九华,安岳,青阳,简阳,东至,乐至,石台,资阳,滁州皖东,自贡,来安,富顺,全椒,成都,天长,关岭,定远,普定,凤阳,毕节,明光,大方,阜阳颍东,织金,阜阳颍泉,黔西,界首,赫章,阜阳颍淮,贵阳,颍上,铜仁,阜南,安顺,临泉,独山,太和,花溪,淮北,安龙,潍溪,贞丰,凤台,紫云,淮南通商,都匀,寿县,荔波,淮南淮河,三穗,黄山屯溪,清镇,黄山徽州,麻江,黄山太平,黄平,歙县,休宁,从江,仁怀茅台,黟县,乌当,祁门,息烽,六安,修文,叶集,六盘水,霍山,黎平,霍邱,天柱,金寨,凯里,舒城,丹寨,马鞍山,镇远,和县,瓮安,含山,福泉,铜陵,惠水,铜陵皖江,龙里,枞阳,平塘,芜湖扬子,三都,无为,兴义,南陵,普安,繁昌,晴隆,芜湖津盛,兴仁,宿州,思南,萧县,湄潭,泗县,砀山,遵义红花岗,遵义汇川,灵璧,余庆,宣城皖南,遵义,郎溪,桐梓,广德,道真,宁国,凤冈,泾县,务川,旌德,玉屏,绩溪,贵定,漳州,剑河,石狮,印江,沙县,昭通昭阳,上杭,威信,三明,水富,莆田,陆良,宁德,罗平,南平,通海,南安,易门,龙岩,新平,晋江,福清汇通,福州,玉溪红塔,华宁,弥勒,平潭,河口,长乐,蒙自,漳平,建水,龙海,泉州,文山市,勐腊,武夷山,景洪,建瓯,禄丰,南昌,湾里,赣昌,南华,楚雄市,大姚,新建,祥云,安义,洱源,进贤,景德镇,大理市,云龙,萍乡,宾川,芦溪,昌宁,上栗,腾冲,莲花,芒市,修水,陇川,武宁,瑞丽南屏,永修,盈江,共青,丽江古城,瑞昌,玉龙,都昌,永胜,湖口,凤庆,彭泽,临沧临翔,庐山,云县,江州,嵩明,九江,寻甸,新余,巍山,鹰潭,景东,崇义,普洱思茅,于都,广南,龙南,马关,宁都,龙陵,上犹,施甸,信丰,梁河,安远,元谋,寻乌,孟连,赣县,彝良,全南,白河,兴国,旬阳,瑞金,平利,定南,汉阴,赣州,紫阳,石城,石泉,大余,岚皋,会昌,镇坪,万安,宁陕,新干,安康,庐陵,宝鸡渭滨,峡江,陇县,吉水,眉县,永新,麟游,泰和,千阳,永丰,凤翔,安福,凤县,吉安,井冈山,太白,西乡,遂川,镇巴,宜春,南郑,丰城,榆林榆阳,樟树,秦农,高安,府谷,奉新,蓝田,上高,西安鄠邑,宜丰,周至,靖安,镇安,铜鼓,柞水,大石桥,盖州,桂东,汝城,营口,安仁,营口融生,桂阳,阜新,郴州,辽阳,永州,辽阳辽东,双牌,灯塔,宁远,建平,江华,大洼,蓝山,葫芦岛,祁阳,兴城,江永,长春,东安,长春发展,道县,榆树,新田,农安,华容,德惠,平江,九台,湘阴,双阳,岳阳,舒兰,汨罗,桦甸,蛟河,临湘,岳阳巴陵,磐石,娄底,环城,双峰,永吉,新化,延边,冷水江,长白山,涟源,敦化,洞口,珲春,邵阳昭阳,汪清,城步,安图,隆回,和龙,邵阳,龙井,绥宁,公主岭,春城,新宁,武冈,通化,新邵,柳河,邵东,集安,常德,辉南,津市,通化海科,石门,白城,临澧,镇赉,汉寿,大安,桃源,辽源,澧县,东丰,安乡,郭尔罗斯,会同,临江,麻阳,白山江源,通道,浑江,新晃,靖宇,洪江,通榆,芷江,大庆,辰溪,肇源,林甸,肇州,杜尔伯特,大兴安岭,靖州,沅陵,中方,怀化,淑浦,呼玛,塔河,漠河,萝北,孙吴,吉首,古丈,凤凰,龙山,永顺,黑河,花垣,北安,逊克,保靖,泸溪,哈尔滨,张家界,延寿,宾州,五常,鸡西,密山,虎林,抚远,建三江,同江,东宁,绥芬河,甘南,泰来,讷河,友谊,绥棱,明水,慈利,桑植,长沙,浏阳,星沙,宁乡,湘江新区,广州,东莞,清远,清新,英德,佛冈,阳山,连州,连南,连山,伊春,茂名,通河,方正,鸡东,克东,五大连池,嫩江,集贤,饶河,高州,化州,信宜,河源,东源,连平,紫金,龙川,齐齐哈尔,和平,富裕,克山,汤原,宝清,绥滨,庆安,安达,中山,揭阳,揭西,揭东,普宁,阳东,阳春,上海,阳江,洪泽,阳西,涟水,新兴,盱眙,罗定,江阴,潮州,张家港,顺德,赣榆,南海,江都,佛山,邳州,惠州,常熟,博罗,南通,惠东,如皋,龙门,扬州,江门,海门,鹤山,建湖,开平,射阳,台山,海安,大埔,镇江,平远,高邮,梅州,句容,丰顺,泗阳,蕉岭,丹阳,兴宁,兴化,五华,仪征,南澳,高淳,汕尾,淮安,陆丰,启东,海丰,沭阳,陆河,响水,乐昌,新沂,南雄,扬中,仁化,徐州淮海,翁源,东台,新丰,如东,乳源,溧水,始兴,宝应,遂溪,金湖,雷州,滨海,徐闻,睢宁,廉江,灌云,湛江,徐州彭城,肇庆端州,丰县,四会,沛县,高要,苏州,怀集,民丰,广宁,江南,德庆,无锡,封开,泗洪,珠海,昆山,上林,东海,马山,姜堰,隆安,盐城,融安,阜宁,鹿寨,紫金,临桂,灌南,灌阳,连云港东方,龙胜,太仓,资源,靖江,恭城,泰州,灵川,泰兴,岑溪,宜兴,蒙山,徐州铜山,罗城,大丰,巴马,杭州联合,田东,萧山,杭州余杭,田阳,靖西,富阳,那坡,建德,凌云,淳安,乐业,临安,田林,桐庐,隆林,温州鹿城,温州瓯海,温州龙湾,温州洞头,西林,浦北,东兴,上思,乐清,陆川,永嘉,崇左桂南,瑞安,大新,平阳,凭祥,苍南,龙州,文成,扶绥,泰顺,宁明,禾城,天等,嘉善,富川,平湖,昭平,海盐,海口联合,海宁,海口,桐乡,三亚,湖州吴兴,澄迈,南浔,文昌,德清,屯昌,长兴,临高,安吉,白沙,绍兴瑞丰,万宁,新昌,重庆,上虞,巴中,嵊州,万源,诸暨,达州,义乌,宣汉,金华成泰,大竹,永康,渠县,东阳,德阳,武义,广汉,浦江,什邡'
        self._char_bank_name += [i+'农商银行' for i in nongshangyinhang.split(',')]
        cunzhenyinhang = '侯马市太行,扶沟郑银,襄汾县万都,商水厦农商,洪洞县洪都,西华厦农商,曲沃县新田,淮阳中银富登,临汾市尧都区惠都,项城中银富登,吉县新田,西平财富,隰县新田,遂平中原,朔州怀仁市慧融,平舆玉川,应县金都,泌阳玉川,朔州市朔城区蒙银,正阳玉川,山阴县太行,上蔡惠民,右玉县长青,确山郑银,盂县汇民,济源齐鲁,平定县昌都,郑州珠江,泽州浦发,叶县泰隆,高平市太行,汝南泰隆,陵川县太行,武汉东西湖扬子,阳城县三禾,恩施兴福,大同市南郊区京都,红安长江,阳高县兴都,麻城汇丰,浑源县慧融,英山长江,左云县长青,黄梅中银富登,灵丘县长青,罗田楚农商,天镇县河东,蕲春中银富登,忻州市忻府区秀都,团风楚农商,五台莱商,武穴中银富登,原平市汇民,浠水楚农商,代县泓都,大冶中银富登,繁峙县新田,大冶泰隆,宁武县瑞都,阳新汉银,神池县河东,荆门掇刀包商,保德县慧融,荆门东宝惠民,和顺县贵都,钟祥民生,介休市华都,京山中银富登,晋中市榆次融信,沙洋中银富登,平遥县晋融,江陵楚农商,太谷县兴泰,公安中银富登,寿阳县汇都,松滋中银富登,祁县晋融,石首楚农商,晋中市左权华丰,监利中银富登,灵石县汇民,洪湖融兴,长子县融汇,随州曾都汇丰,长治县泰都,随县楚农商,襄垣县融汇,广水楚农商,武乡县泽都,咸安长江,长治市屯留区三禾,赤壁长江,沁源县长青,嘉鱼吴江,壶关县晋融,通城惠民,吕梁孝义汇通,崇阳楚农商,柳林汇泽,通山楚农商,汾阳市九都,枣阳中银富登,中阳县太行,宜城中银富登,临县泉都,谷城中银富登,交口县融都,南漳中银富登,文水县润都,老河口中银富登,交城县太行,保康楚农商,岚县慧融,应城融兴,兴县汇泽,孝昌本富,呼和浩特市新城蒙银,安陆楚农商,呼和浩特市玉泉蒙银,大悟楚农商,呼和浩特市赛罕蒙银,云梦楚农商,土默特左旗金谷,汉川农银,呼和浩特市赛罕金谷,长阳兴福,呼和浩特金桥河套,宜都民生,武川立农,五峰金谷,和林格尔包商,远安金谷,呼和浩特市如意蒙银,宜昌夷陵兴福,托克托立农，秭归兴福,包头市九原立农,当阳兴福,包头市东河金谷,兴山本富,包头市昆都仑蒙银,枝江汉银,土默特右旗蒙银,房县楚农商,包头市高新银通,竹山楚农商,包头青山河套,竹溪楚农商,固阳包商,郧县楚农商,达尔罕茂明安联合旗包商,郧西楚农商,莫力达瓦包商,丹江口楚农商,扎兰屯蒙银,武汉江夏民生,鄂温克包商,天门汇丰,突泉蒙银,潜江中银富登,扎赉特蒙银,仙桃楚农商,兴安盟科尔沁包商,神农架楚农商,通辽金谷,茶陵浦发,开鲁蒙银,攸县潭农商,霍林郭勒蒙银,株洲县融兴,克什克腾农银,醴陵沪农商,宁城包商,湘乡市,赤峰市松山立农,韶山光大,翁牛特立农,湘潭湘淮,敖汉惠农,桃江中银富登,赤峰市红山玉龙,沅江浦发,赤峰市元宝山玉龙,安化湘淮,喀喇沁玉龙,南县湘江,太仆寺旗鑫源,衡阳县沪农商,西乌珠穆沁包商惠丰,耒阳融兴,正蓝旗汇泽,衡南浦发,东乌珠穆沁农信开元,常宁珠江,察哈尔右翼前旗蒙银,衡山潭农商,卓资蒙银,宜章长行,化德包商,桂阳沪农商,乌兰察布市集宁包商,永兴沪农商,四子王蒙银,临武浦发,北京密云汇丰,嘉祥中银富登,北京延庆,邹城中银富登,北京怀柔融兴,济宁高新,北京大兴九银,梁山民丰,北京昌平包商,济宁儒商,北京大兴华夏,曲阜中银富登,北京顺义银座,汶上中银富登,北京通州中银富登,鱼台青隆,北京门头沟珠江,泗水齐丰,北京房山沪农商,微山北海,北京平谷新华,济宁蓝海,天津市蓟州,金乡蓝海,天津市北辰,兖州中成,天津华明,莱芜中成,天津津南,莱芜珠江,天津西青中银富登,阳谷沪农商,天津静海新华,聊城沪农商,天津武清,临清沪农商,天津宝坻浦发,荏平沪农商,天津宁河,莘县青隆,天津滨海惠民,高唐青隆,天津滨海江淮,东阿青隆,天津滨海德商,冠县齐丰,天津滨海扬子,沂水中银富登,安平惠民,临沭民丰,深州丰源,兰陵,武强家银,费县梁邹,阜城家银,郯城汉源,故城家银,平邑汉源,饶阳民商,临沂河东齐商,武邑邢农商,蒙阴齐丰,枣强丰源,莒南,衡水冀州丰源,沂南蓝海,景县丰源,莒县金谷,邯郸邯山齐鲁,日照九银,成安齐鲁,日照沪农商,涉县齐鲁,五莲中银富登,魏县齐鲁,日照蓝海,邯郸永年齐鲁,济南长清沪农商,磁县齐鲁,济南槐荫沪农商,武安,商河汇金,邯郸肥乡恒升,济阳北海,大名恒升,历城圆融,曲周恒升,济南高新北海,香河益民,平阴蓝海,廊坊市安次区惠民,章丘齐鲁,文安县惠民,肥城民丰,永清吉银,东平沪农商,三河蒙银,宁阳沪农商,大厂回族自治县新华,泰安沪农商,廊坊市广阳舜丰,新泰齐丰,霸州舜丰,乳山天骄,大城舜丰,荣成汇丰,廊坊开发区融商,文登中银富登,固安恒升,威海富民,唐山市丰南舜丰,寿光张农商,唐山市开平汇金,潍坊市寒亭区蒙银,乐亭舜丰,高密惠民,滦州中成,青州中银富登,滦南中成,诸城中银富登,迁安襄隆,临朐聚丰,遵化融和,潍坊市奎文区中成,玉田大商,昌乐乐安,丰宁中银富登,潍坊市潍城区北海,滦平盛阳,昌邑北海,围场满族蒙古族自治县华商,安丘北海,宽城融兴,龙口中银富登南山,承德县恒升,海阳珠江,平泉恒升,烟台福山珠江,张北信达,招远中银富登,蔚县银泰,栖霞中银富登,康保银丰,牟平胶东,宣化中成,莱阳胶东,赤城家银,莱州珠江,张家口万全家银,芝罘齐丰,张家口宣化家银,莱山齐丰,涿鹿利丰,蓬莱民生,怀来利丰,滕州中银富登,张家口崇礼邢农商,沂源博商,昌黎家银,临淄汇金,卢龙家银,桓台青隆,秦皇岛抚宁家银,高青汇金,青龙融兴,淄博博山北海,唐县汇泽,淄博淄川北海,涿州中成,周村青隆,定州中成,郑州金水厦农商,望都中成,中牟郑银,安国中成,荥阳利丰,高碑店中成,新郑郑银,曲阳中成,新密郑银,保定满城区利丰,巩义浦发,涞水利丰,登封齐鲁,保定清苑区邢农商,开封新东方,阜平大商,尉氏合益,安新大商,兰考齐鲁,雄县丰源,杞县中银富登,定兴丰源,通许融信,容城邢农商,伊川齐鲁,清河金农,栾川民丰,宁晋民生,孟津民丰,沙河襄通,偃师融兴,邢台县邢农商,新安融兴,任县邢农商,宜阳兴福,威县邢农商,洛宁兴福,南和融信,汝阳兴福,柏乡融信,嵩县兴福,巨鹿融信,郏县广天,任丘,汝州玉川,黄骅青隆,宝丰豫丰,沧县吉银,安阳珠江,河间融惠,汤阴兴福,东光青隆,内黄兴福,青县青隆,滑县中银富登,沧州海兴新华,林州德丰,沧州盐山新华,淇县中原,献县融和,浚县郑银,沧州市运河青隆,新乡新兴,孟村回族自治县融信,长垣民生,南皮融信,辉县珠江,吴桥融信,卫辉富民,藁城恒升,武陟射阳,鹿泉恒升,孟州射阳,石家庄新华恒升,沁阳江南,正定恒升,温县齐鲁,深泽利丰,台前德商,辛集齐鲁,范县德商,行唐利丰,濮阳中原,石家庄栾城齐鲁,襄城汇浦,元氏信融,禹州新民生,晋州恒升,长葛轩辕,平柏坡冀银,鄢陵郑银,赞皇隆兴,许昌新浦,古交市汇泽,漯河市郾城包商,古交市阜民,临颍中银富登,阳曲县汇民,舞阳玉川,娄烦县三禾,灵宝融丰,清徐晋商,卢氏中原,清徐惠民,渑池齐鲁,太原市尖草坪区信都,方城凤裕,万荣县汇民,南阳,临猗县新田,新野中银富登,新绛县新田,永城齐鲁,永济市三禾,虞城通商,河津市龙都,柘城黄淮,闻喜县晋融,睢县德商,平陆县河东,宁陵德商,垣曲县河东,民权德商,夏县河东,固始天骄,稷山县河东,信阳平桥中原,汾西县太行,信阳珠江,汾西县亿通,沈丘中银富登,武进中银富登,成都龙泉驿稠州,常州新北中成,成都双流诚民,常州金坛兴福,新津珠江,常州钟楼长江,成都青白江融兴,金湖民泰,巴中中银富登,涟水太商,平昌农科,淮安光大,南江农科,盱眙珠江,达州达川中银富登,淮安清浦兴福,大竹渝农商,淮安淮阴兴福,宣汉诚民,淮安清河兴福,什邡思源,洪泽金阳光,绵竹浦发,南京浦口靖发,广汉珠江,高淳武家嘴中银富登,中江融兴,溧水民丰,广安恒丰,江宁上银,岳池中银富登,南京六合九银,武胜中银富登,灌南民丰,邻水中银富登,赣榆通商,广元市贵商,东海张农商,广元市包商贵民,灌云民丰,乐山昆仑,海门中银富登,乐山嘉州民富,海安盐海,峨眉山中成,如东融兴,犍为中成,通州华商,泸县元通,启东珠江,彭山珠江,南通如皋包商,仁寿民富,苏州常熟中银富登,北川羌族自治县富民,张家港渝农商,江油华夏,苏州吴江中银富登,南充嘉陵中成,苏州吴中珠江,南部县中成,昆山鹿城,仪陇惠民,太仓民生,阆中融兴,宿豫东吴,内江兴隆,泗洪东吴,遂宁安居融兴,沭阳东吴,蓬溪中银富登,宿迁宿城兴福,西昌金信,泗阳东吴,名山锦程,靖江润丰,雅安雨城惠民,兴化苏南,宜宾兴宜,泰兴中银富登,筠连中成,泰州姜堰锡州,长宁中成,泰州高港兴福,资阳民生,宜兴阳羡,自贡中成,江阴浦发,安顺西航南马,惠山民泰,镇宁汇商,锡山中银富登,安顺西秀富民,无锡滨湖兴福,关岭恒升,铜山锡州,平坝鼎立,沛县汉源,紫云富民,丰县民丰,普定富民,新沂汉源,毕节发展,睢宁中银富登,黔西花都,邳州陇海,金沙富民,射阳太商,织金惠民,阜宁民生,赫章富民,东台稠州,威宁富民,建湖中成,纳雍富民,响水中银富登,大方富民,大丰江南,贵阳花溪建设,盐城滨海兴福,息烽包商黔隆,邗江民泰,贵阳白云德信,江都吉银,清镇兴邦,宝应锦程,贵阳观山湖富民,邗江联合,贵阳乌当富民,仪征包商,贵阳云岩富民,扬州高邮兴福,贵阳小河科技,扬州广陵中成,开阳富民,丹阳保得,修文江海,扬中恒丰,贵安新区发展,丹徒蒙银,贵阳南明富民,镇江润州长江,水城蒙银,句容苏南,六盘水钟山凉都,丽水莲都中银富登,青田中银富登华侨,六盘水六枝富民,盘州万和,缙云联合,施秉金鼎,遂昌富民,从江月明,松阳恒通,凯里东南,云和联合,黄平振兴,龙泉民泰,龙里国丰,景宁银座,都匀融通,庆元泰隆,贵定恒升,嵊州瑞丰,福泉富民,新昌浦发,惠水恒升,诸暨联合,长顺富民,上虞富民,独山富民,柯桥联合,兴义万丰,玉环永兴,兴仁振兴,三门银座,册亨富民,临海湖商,望谟富民,温岭联合,黔西南义龙浦发,天台民生,晴隆兴安,台州黄岩恒升,贞丰兴贞,台州路桥富民,安龙兴龙,仙居富民,普安普惠,定海德商,铜仁丰源,舟山普陀稠州,松桃长征,岱山稠州,沿河长征,武义中银富登,印江长征,兰溪越商,石阡长征,浦江嘉银,德江长征,磐安婺商,江口长征,永康农银,铜仁万山长征,义乌联合,仁怀蒙银,东阳富民,绥阳黔北,萧山湖商,遵义汇川黔兴,建德湖商,遵义红花岗富民,富阳恒通,习水中银富登,临安中信,赤水中银富登,淳安中银富登,桐梓中银富登,桐庐恒丰,湄潭中银富登,乐清联合,务川中银富登,永嘉恒升,正安中银富登,苍南中银富登,凤冈中银富登,平阳浦发,余庆中银富登,文成北银,道真中银富登,洞头富民,遵义播州汇隆,泰顺温银,遵义新蒲长征,瑞安湖商,瓮安富民,嘉善联合,平塘富民,平湖工银,玉屏长征,桐乡民泰,荔波富民,秀洲德商,三都富民,海盐湖商,思南长征,海宁德商,丹寨富民,长兴联合,罗甸发展,安吉交银,台江富民,德清湖商,剑河富民,衢州衢江上银,昭通昭阳富滇,龙游义商,曲靖惠民,江山中银富登,曲靖富源富滇,常山联合,曲靖宣威长江,余杭德商,曲靖会泽长江,桐城江淮,罗平兴福,永新庐陵,遂川洪都,永丰洪都,峡江洪都,乐平融兴,浮梁农商,景德镇昌江九银,都昌九银,九江共青,湖口九银,庐山九银艺术,武宁恒通,九江恒通,九江庐山浔银,瑞昌九银,修水九银,永修浔银,彭泽九银,莲花富民,芦溪富民,上栗富民,萍乡湘东黄海,萍乡安源富民,广丰广信,万年黄河,玉山三清山,上饶中银富登,余干恒通,横峰恒通,婺源江淮,信州江淮,鄱阳恒通,德兴蓝海,弋阳蓝海,新余孔目江成功,新余渝水湘淮,分宜九银,丰城顺银,樟树顺银,宜丰中银富登,奉新九银,靖安九银,铜鼓九银,高安富民,上高富民,贵溪九,鹰潭月湖恒通,邹平青隆,博兴新华,邹平浦发,惠民舜丰,滨州河海,阳信河海,沾化青云,无棣中成,临邑中银富登,庆云乐安,禹城胶东,齐河胶东,宁津胶东,乐陵圆融,德州陵城圆融,武城圆融,平原圆融,夏津胶东,东营河口中成,广饶梁邹,东营融和,利津舜丰,东营莱商,垦利乐安,曹县中银富登,鄄城包商,东明中银富登,巨野中银富登,成武汉源,菏泽牡丹北海,郓城北海,定陶河海,单县中银富登,隆德六盘山,原州津汇,西吉汇发,彭阳贺兰山,青铜峡贺兰山,盐池汇发,红寺堡汇发,同心津汇,吴忠市滨河,库车国民,阿拉尔津汇,富蕴中成,北屯国民,库尔勒富民,铁门关津汇,博乐国民,五家渠国民,乌鲁木齐米东浦发,昌吉国民,呼图壁津汇,奇台利丰,哈密天山,哈密红星国民,克拉玛依金龙国民,石河子国民,石河子交银,塔城昆仑,乌苏利丰,塔城津汇,鄯善中成,绿洲国民,乌鲁木齐县利丰,建新成功,奎屯国民,伊犁国民,尉犁达西冀银,阜康津汇,大连金州联丰,庄河汇通,大连经济技术开发区鑫汇,大连甘井子浦发,瓦房店长兴,大连保税区珠江,大连旅顺口蒙银,大连普兰店汇丰,余姚通济,宁波市海曙国民,宁波慈溪中银富登,宁波北仑中银富登,宁波宁海西店中银富登,宁波江北富民,宁海中银富登,宁波海曙浦发,象山中银富登,慈溪民生,宁波镇海中银富登,象山国民,宁波奉化罗蒙,厦门同安农银,厦门翔安民生,青岛黄岛舜丰,青岛即墨惠民,青岛崂山交银,青岛城阳珠江,青岛莱西元泰,青岛胶州中成,青岛平度惠民,青岛西海岸海汇,深圳宝安融兴,深圳龙岗鼎业,深圳福田银座,深圳南山宝生,深圳宝安桂银,深圳龙岗中银富登,深圳光明沪农商,深圳坪山珠江,深圳龙华新华,深圳罗湖蓝海,堆龙民泰,林芝民生,凉城县乌拉特,兴和包商,达拉特中银富登,乌审旗包商,鄂托克兴生源,鄂托克旗汇泽,鄂托克前旗蒙银,鄂尔多斯市天骄蒙银,鄂尔多斯市铁西蒙银,鄂尔多斯市罕台,伊金霍洛六菱,伊金霍洛金谷,杭锦大众,鄂尔多斯市东胜蒙银,鄂尔多斯市康巴什,鄂尔多斯市塔拉壕金谷,准格尔旗包商,巴彦淖尔市临河黄河,乌拉特前旗大众,乌拉特中旗蒙银,磴口蒙银,杭锦后旗河套,巴彦淖尔市乌拉特,五原蒙银,乌海市海勃湾黄河,乌海千里山河套,乌海市乌拉特,阿拉善左旗方大,阿拉善左旗黄河,千山金泉,台安金安,岫岩金玉,海城金海,本溪同盛,本溪禾丰,建平红山,凌源天元,朝阳柳城,北票盛都,喀左锦银,凤城丰益,丹东鼎安,丹东鼎元,宽甸百丰,东港同合,丹东福汇,抚顺市清原,抚顺顺城抚银,抚顺东洲抚银,抚顺望花抚银,抚顺新宾抚银,沈东,彰武金通,阜新农商,绥中长丰,葫芦岛国信,兴城长兴,建昌恒昌,锦州太和锦银,锦州松山农商,义县锦银,黑山锦银,北镇锦银,沈阳沈北富民,沈阳新民富民,沈阳法库富民,沈阳辽中富民,沈阳于洪永安,沈阳康平抚银,首山,灯塔,太子河,盘山安泰,大洼恒丰,昌图民祥,西丰鹿城,铁岭农商,铁岭新星,开原象牙山,调兵山惠民,辰州汇通,大石桥隆丰,营口宏诚,凌海锦银,桓仁锦银,本溪丰业,本溪丰泰,长春净月榆银,九台龙嘉,农安北银,长春双阳吉银,榆树融兴,长春二道农商,长春绿园融泰,长春南关惠民,长春经开融丰,长春高新惠民,长春宽城融汇,通化二道江瑞丰,集安惠鑫,辉南榆银,通化东昌榆银,资兴浦发,祁阳,江华新阳,宁远潭农商,东安星龙,道县神农,蓝山神农,平江汇丰,汨罗中银富登,华容星龙,岳阳湘江,双峰沪农商,涟源沪农商,冷水江湘淮,新化星龙,武冈包商,洞口潭农商,邵东湘淮,邵阳湘江,隆回湘江,新宁潭农商,新邵湘淮,澧县沪农商,临澧沪农商,石门沪农商,津市湘淮,桃源湘淮,汉寿星龙,芷江湘江,淑浦湘江,沅陵新阳,湘西长行,慈利沪农商,宁乡沪农商,长沙星沙沪农商,浏阳江淮,湘阴星龙,安仁新阳,汝城新阳,中方新阳,衡东新阳,广州花都稠州,广州白云民泰,广州从化柳银,广州番禺新华,广州黄埔惠民,广州黄埔融和,广州增城长江,东莞长安,东莞厚街华业,东莞大朗东盈,东莞常平新华,东莞虎门长江,东莞黄江珠江,清远清新惠民,英德泰隆,茂名电白长江,茂名高州长江,中山小榄,中凤珠江,中山古镇南粤,普宁汇成,阳江阳春长江,云浮新兴东盈,云安惠民,饶平融和,潮州潮安长江,佛山高明顺银,三水珠江,佛山南海新华,惠州仲恺东盈,惠东惠民,惠州博罗长江,恩平汇丰,鹤山珠江,江门新会新华,江门开平长江,梅县客家银行股份五华惠民,兴宁珠江,澄海潮商,汕头龙湖长江,汕头潮阳融和,始兴大众,雷州惠民,湛江廉江长江,德庆华润,四会泰隆,珠海横琴,珠屏,东源泰业,龙川融和,百色靖西长江,来宾象州长江,崇左大新长江,南宁隆安长江,南宁兴宁长江,南宁马山长江,宜州深通,田阳兴阳,田东北部湾,平果国民,通化融达,灵山泰业,梅河口民生,灵川深通,柳河蒙银,藤县桂银,通榆农商,钦州市钦南国民,大安惠民,浦北国民,白城洮北惠民,平南桂银,镇赉中银富登,桂平桂银,洮南惠民,东兴国民,靖宇乾丰,百色右江华润,抚松榆银,岑溪市北部湾,长白榆银,银海国民,临江蛟银,合浦国民,白山浑江恒泰,扶绥深通,前郭县阳光,防城港防城国民,乾安惠民,南宁江南国民,扶余惠民,宾阳北部湾,长岭蛟银,南宁武鸣漓江,松原宁江惠民,上林国民,永吉吉庆,横县桂商,舒兰吉银,桂林国民,磐石吉银,兴安民兴,蛟河吉银,贺州八步东盈,桦甸惠民,柳江柳银,丰满惠民,鱼峰信合,船营惠民,融水柳银,昌邑榆银,鹿寨渝农商,辽源龙山榆银,苍梧深通,东辽农商,容县桂银,东丰吉银,北流柳银,敦化江南,兴业柳银,安图农商,博白柳银,珲春吉银,陆川柳银,延吉和润,海口苏南,汪清和润,保亭融兴,双辽吉银,白沙长江,公主岭浦发,昌江长江,公主岭华兴,澄迈长江,四平铁东德丰,儋州绿色,梨树源泰,定安合丰,伊通榆银,东方惠丰,四平辽河蛟银,屯昌长江,图们敦银,乐东惠丰,和龙敦银,临高惠丰,四平铁西敦银,陵水惠民,德惠敦银,琼海大众,长春朝阳和润,琼中长江,辽源西安区榆银,三亚惠民,龙井榆银,万宁国民,龙潭华益,文昌犬众,白山江源汇恒,五指山长江,杜尔伯特润生,兴福,五大连池惠丰,重庆市沙坪坝融兴,双城惠民,重庆南岸中银富登,延寿融兴,重庆九龙坡民泰,五常惠民,重庆市大渡口融兴,巴彦融兴,重庆万州滨江中银富登,哈尔滨阿城农商,重庆万州中银富登,依兰惠鑫,重庆开州泰业,哈尔滨呼兰浦发,重庆梁平澳新,哈尔滨农信,重庆忠县稠州,尚志惠鑫,重庆云阳恒丰,哈尔滨宾洲,重庆奉节中银富登,桦川融兴,重庆巫山中银富登,桦南融兴,重庆巫溪中银富登,东宁润生,重庆城口中银富登,海林远东,重庆涪陵中银富登,穆棱远东,重庆南川石银,宁安融兴,重庆垫江中银富登,克山润生,重庆丰都汇丰,依安润生,重庆市武隆融兴,拜泉融兴,重庆黔江银座,讷河融兴,重庆市酉阳融兴,集贤润生,重庆彭水民泰,宝清广益,重庆石柱中银富登,兰西农商,重庆秀山北银,海伦惠丰,重庆江北恒丰,肇东中银富登,重庆渝北银座,哈尔滨幸福,重庆北碲稠州,富锦幸福,重庆长寿中银富登,嫩江幸福,重庆巴南浦发,安达幸福,綦江民生,密山民意,重庆荣昌汇丰,同江汇鑫,重庆大足汇丰,上海宝山富民,重庆永川北银,上海崇明沪农商,重庆江津石银,上海奉贤浦发,重庆璧山工银,上海金山惠民,重庆合川中银富登,上海闵行上银,重庆铜梁浦发,上海浦东恒通,潼南民生,上海浦东中银富登,崇州上银,上海浦东江南,大邑交银兴民,上海青浦惠金,都江堰金都,上海嘉定洪都,金堂汇金,上海松江富明,彭州民生,上海松江民生,成都郫都中银富登,上海嘉定民生,新都桂城,上海宝山扬子,成都蒲江民富,溧阳浦发,邛崃国民,潜山江淮,师宗兴福,望江新华,陆良兴福,宿松民丰,曲靖沾益兴福,岳西湖商,马龙北银,太湖江淮,玉溪红塔区兴和,怀宁江淮,玉溪澄江中成,五河永泰,易门兴福,怀远本富,江川兴福,固镇新淮河,元江北银,谯城湖商,新平北银,利辛湖商,弥勒沪农商,蒙城湖商,开远沪农商,涡阳湖商,个旧沪农商,长丰科源,蒙自沪农商,肥西石银,建水沪农商,巢湖扬子,石屏北银,肥东湖商,文山马关长江,庐江惠民,文山丘北长江,池州贵池民生,文山富宁长江,青阳九华,文山民丰,东至扬子,文山广南长江,石台扬子,文山砚山长江,来安中银富登,普洱民生,全椒中银富登,景洪民生,天长民生,西双版纳勐海长江,定远民丰,西双版纳勐腊长江,凤阳利民,楚雄兴彝,明光民丰,禄丰龙城富滇,颍上中银富登,南华兴福,界首中银富登,武定兴福,太和中银富登,元谋兴福,阜南中银富登,大理渝农商,临泉中银富登,鹤庆渝农商,潍溪湖商,祥云渝农商,寿县联合,大理古城中成,凤台通商,大理宾川长江,黄山金桥,大理洱源长江,休宁大地,大理巍山长江,歙县嘉银,保山隆阳沪农商,黟县新淮河,腾冲民生,徽州铜源,保山昌宁长江,祁门铜源,保山龙陵长江,裕安盛平,保山施甸长江,霍山联合,德宏芒市长江,霍邱联合,瑞丽沪农商,金寨徽银,丽江古城富滇,金寨江淮,丽江玉龙长江,舒城正兴,丽江永胜长江,当涂新华,泸水中成,和县新华,香格里拉渝农商,含山惠民,临沧临翔沪农商,铜陵铜源,昆明呈贡华夏,枞阳泰业,嵩明沪农商,繁昌中银富登,富民浦发,无为徽银,昆明马金铺中成,芜湖圆融,昆明石林中成,南陵太平,昆明禄劝中成,宿州淮海,昆明寻甸中成,灵璧本富,昆明东川中成,宣州湖商,安宁稠州,郎溪新华,昆明五华长江,广德扬子,昆明宜良融丰,宁国民生,昆明晋宁融丰,泾县铜源,昆明阿拉沪农商,绩溪农银,西山渝农商,旌德民商,昆明盘龙兴福,漳平民泰,西山北银,永定瑞狮,安康汉滨中银富登,永安汇丰,凤翔中银富登,新罗晋农商,岐山长银,仙游瑞狮,城固中银富登,武平杭兴,汉中南郑汇发,平潭渝农商,西安高陵阳光,闽清瑞狮,西安长安新华,闽侯民本,蓝田中银富登,罗源汇融,户县海丝,连江恒欣,临潼海丝,连城杭兴,周至农科,福安渝农商,西安雁塔恒通,漳浦民生,洛南阳光,上杭中成,铜川耀州新华,长汀汀州红,铜川印台恒通,武夷山本富,韩城浦发,浦城中成,蒲城中银富登,建瓯瑞狮,合阳惠民,建阳瑞狮,富平汇发,光泽刺桐红,乾县中银富登,邵武刺桐红,兴平中银富登,福鼎恒兴,三原海丝,古田刺桐红,咸阳渭城汇发,屏南刺桐红,安塞中银富登,寿宁刺桐红,志丹民生,柘荣刺桐红,安塞农银,周宁刺桐红,吴起汇发,霞浦刺桐红,榆林榆阳民生,蕉城刺桐红,榆林横山汇发,安溪民生,扶风浦发,惠安中成,太白长银,南安汇通,旬邑中银富登,石狮渝农商,长武中银富登,永春漳农商,淳化中银富登,沙县渝农商,永寿中银富登,宁化成功,陇县长银,建宁刺桐红,汉中汉台铺镇聚利,大田晋农商,商南聚利,将乐成功,柞水聚利,尤溪成功,旬阳泰隆,泰宁晋农商大金湖,泾阳泰隆,南靖中成,眉县泰隆,诏安汇通,兰州安宁神舟,东山润鑫,西固金城,云霄润发,兰州永登新华,平和润丰,兰州七里河新华,泉州台商投资区晋农商,兰州皋兰新华,德化成功,榆中浦发,政和泰隆,敦煌市金盛,福清泰隆,民勤融信,长乐泰隆,会宁会师,龙海泰隆,白银平川中银富登,安义融兴,临洮县金城,南昌昌东九银,陇西神舟,南昌大丰,天水市秦安众信,南昌新建恒通,天水麦积融兴,进贤瑞丰,天水秦州长银,临川浦发,平凉市静宁成纪,南丰桔都,泾川中银富登,广昌南银,平凉崆峒融兴,乐安洪都,庆阳市西峰瑞信,资溪九银,合水县金城,崇仁九银,庆城县金城,宜黄抚商,陇南市武都金桥,黎川抚商,永靖县金城,金溪抚商,和政神舟,南城富民,湟中三江,抚州东乡富民,乐都三江,赣州银座,大通中银富登,南康赣商,平安大通,兴国新华,门源大通,瑞金光大,西夏贺兰山,吉安稠州,贺兰回商,吉州珠江,银川掌政石银,井冈山九银,宁东本富,安福中银富登,永宁汇发,泰和中银富登,中卫香山,万安洪都,中宁青银,新干中银富登,石嘴山市大武口石银,吉水庐陵,平罗沙湖,青原庐陵,惠农贺兰山'
        self._char_bank_name += [i+'村镇银行' for i in cunzhenyinhang.split(',')]
        hezuoshe = '汕头市澄海,深泽县,汕头经济特区,无极县,汕头市金砂,石家庄市藁城,汕头市岐山,石家庄市栾城,汕头市舵浦,赵县,汕头市下蓬,新乐市,汕头市珠池,高邑县,汕头市碧石,赞皇县,汕头市河浦,行唐县,韶关市区,石家庄市矿区,韶关市曲江区,蔚县,吴川市,怀安县,肇庆市鼎湖区,赤城县,壮族自治区,康保县,南宁市区,尚义县,南宁市邕宁区,隆化县,南宁市武鸣区,平泉市,横县,兴隆县,宾阳县,承德市郊区,柳州市区,秦皇岛市区,三江侗族自治县,抚宁县,融水苗族自治县,昌黎县,梧州市区,青龙满族自治县,苍梧县,乐亭县,藤县,迁西县,河池市区,遵化市,环江毛南族自治县,廊坊市城郊,南丹县,大城县,天峨县,雄县,东兰县,唐县,凤山县,阜平县,都安瑶族自治县,曲阳县,大化瑶族自治县,涞源县,德保县,博野县,北海市区,望都县,合浦县,安新县,钦州市区,顺平县,灵山县,易县,防城港市区,容城县,防城港市防城区,定兴县,贵港市区,保定市徐水区,桂平市,保定市清苑区,保定市满城区,平南县,玉林市区,高阳县,兴业县,海兴县,容县,东光县,北流市,河间市,博白县,吴桥县,武宣县,盐山县,金秀瑶族自治县,肃宁县,忻城县,孟村回族自治县,合山市,泊头市,钟山县,任丘市,沧县,海口市,青县,保亭黎族苗族自治县,故城县,昌江黎族自治县,饶阳县,儋州市,武邑县,定安县,隆尧县,东方市农村信用合用联社平乡县,乐东黎族自治县,南宫市,陵水黎族自治县,内丘县,琼海市,新河县,威县,琼中黎族苗族自治县,股份有限公司五指山市,成安县,阿坝州,磁县,通江县,邱县,南江县,临漳县,平昌县,曲周县,开江县,魏县,中江县,邯郸市城区,甘孜州,馆陶县,旺苍县,广平县,乐山市五通桥区,肥乡县,乐山市沙湾区,武安市,乐山市金口河区,永年县,沐川县,邯郸市峰峰矿区,马边彝族自治县,夹江县,忻州市,井研县,吕梁市,峨边彝族自治县,运城市,洪雅县,陵川县,盐亭县,应县,绵阳市涪城区,太原市城区,北川羌族自治县,娄烦县,江油市,大同市云州区,绵阳市游仙区,阳高县,资中县,天镇县,蓬安县,浑源县,天全县,广灵县,芦山县,平定县,宝兴县,祁县,荥经县,石楼县,汉源县,交口县,石棉县,汾阳市,荣县,文水县,方山县,临县,镇宁布依族苗族自治县,安顺市平坝区,离石区,纳雍县,中阳县,威宁县,霍州市,金沙县,翼城县,开阳县,古县,六枝特区,吉县,水城县,蒲县,盘县,定襄县,雷山县,代县,锦屏县,偏关县,台江县,自治区,榕江县,额济纳旗,岑巩县,阿拉善右旗,施秉县,乌拉特后旗,长顺县,磴口县,罗甸县,乌拉特中旗,册亨县,达尔罕茂明安联合旗,望谟县,固阳县,江口县,包头市南郊,石阡县,喀喇沁旗,德江县,赤峰市红山区,沿河土家族自治县,敖汉旗,松桃苗族自治县,翁牛特旗,赤水市,巴林左旗,绥阳县,巴林右旗,习水县,乌审旗,正安县,准格尔旗,达拉特旗,伊金霍洛旗矿区,鲁甸县,准格尔煤田,巧家县,杭锦旗,盐津县,阿荣旗,大关县,莫力达瓦达斡尔族自治旗,永善县,新巴尔虎右旗,绥江县,新巴尔虎左旗,镇雄县,根河市,曲靖市,扎兰屯市,富源县,陈巴尔虎旗,会泽县,额尔古纳市,曲靖市马龙区,武川县,曲靖市麒麟区,和林格尔县,师宗县,清水河县,宣威市,土默特左旗,曲靖市沾益区,开鲁县,峨山彝族自治县,科尔沁左翼后旗,元江哈尼族彝族傣族自治县,科尔沁左翼中旗,玉溪市江川区,扎鲁特旗,澄江县,通辽市科尔沁区,个旧市,库伦旗,开远市,霍林郭勒市,石屏县,化德县,泸西县,卓资县,屏边县,凉城县,红河县,四子王旗,元阳县,商都县,绿春县,察哈尔右翼后旗,金平苗族瑶族傣族自治县,兴和县,丘北县,丰镇市,砚山县,察哈尔右翼中旗,西畴县,镶黄旗,富宁县,平顶山市石龙区,郏县,鲁山县,平顶山市新华区,夏邑县,虞城县,睢县,宁陵县,新乡市凤泉区,封丘县,新乡县,卫辉市,信阳市明港,信阳市平桥区,商城县,信阳市源河区,禹州市,淮阳县,西华县,郸城县,临颍县,舞阳县,漯河市源汇区,漯河市郾城区,漯河市召陵区,濮阳县,十堰市,茂名市,韶关市,湛江市,惠来县,阳江市海陵区,云浮市云城区,云浮市云安区,郁南县,汕头市潮阳,玛纳斯县,伊吾县,巴里坤哈萨克自治县,民丰县,于田县,策勒县,洛浦县,和田市,皮山县,和田县,墨玉县,叶城县,泽普县,麦盖提县,疏附县,伽师县,莎车县,塔什库尔干县,疏勒县,英吉沙县,巴楚县,岳普湖县,阿克陶县,阿图什市,阿合奇县,乌恰县,裕民县,托里县,和布克赛尔蒙古自治县,额敏县,鄯善县,托克逊县,吐鲁番市,察布查尔县,尼勒克县,新源县,巩留县,特克斯县,象山县,宁波市市区,阿巴嘎旗,麻栗坡县,正蓝旗,墨江哈尼族自治县,苏尼特右旗,澜沧拉祜族自治县,正镶白旗,西盟佤族自治县,东乌珠穆沁旗,多伦县,苏尼特左旗,宁洱哈尼族彝族自治县,江城哈尼族彝族自治县,镇沅彝族哈尼族拉祜族自治县,扎赉特旗,景谷傣族彝族自治县,科尔沁右翼前旗,勐海县,科尔沁右翼中旗,牟定县,乌兰浩特市,双柏县,突泉县,武定县,姚安县,沈阳市,永仁县,辽中县,漾濞彝族自治县,沈阳市苏家屯区,永平县,法库县,鹤庆县,康平县,弥渡县,台安县,南涧彝族自治县,抚顺县,剑川县,抚顺市顺城区,保山市隆阳区,本溪市市区,瑞丽市,凌海市,华坪县,义县,宁蒗彝族自治县,北镇市,泸水市,黑山县,兰坪白族普米族自治县,阜新蒙古族自治县,福贡县,彰武县,铁岭县,贡山独龙族怒族自治县,德钦县,昌图县,维西傈僳族自治县,开原市,香格里拉市,铁岭市清河区,镇康县,调兵山市,耿马傣族佤族自治县,西丰县,永德县,铁岭市银州区,双江拉祜族佤族布朗族傣族自治县,朝阳县,沧源佤族自治县,北票市,昆明市,凌源市,昆明市西山区,喀左县,安宁市,朝阳市龙城区,石林彝族自治县,朝阳市双塔区,昆明市五华区,盘锦市双台子区,富民县,盘锦市兴隆台区,禄劝彝族苗族自治县,盘山县,宜良县,绥中县,昆明市东川区,建昌县,昆明市盘龙区,四平市城区,昆明市呈贡区,伊通满族自治县,昆明市晋宁区,双辽市,梨树县,宝鸡市陈仓区,梅河口市,岐山县,洮南市,扶风县,东辽县,宝鸡市金台区,乾安县,城固县,扶余市,汉中市汉台区,松原市宁江区,洋县,长岭县,勉县,长白朝鲜族自治县,佛坪县,抚松县,宁强县,留坝县,略阳县,哈尔滨市,西安市长安区,佳木斯市,商洛市商州区,牡丹江市,洛南县,齐齐哈尔市,宜君县,绥化市,铜川市王益区,鹤岗市市区,铜川市印台区,木兰县,铜川市耀州区,尚志市,潼关县,哈尔滨市阿城区,澄城县,依兰县,华阴市,巴彦县,合阳县,哈尔滨市双城区,富平县,哈尔滨市呼兰区,大荔县,富锦市,白水县,桦川县,蒲城县,佳木斯市郊区,渭南市临渭区,桦南县,渭南市华州区,穆棱市,乾县,林口县,礼泉县,宁安市,淳化县,海林市,武功县,牡丹江市城郊,旬邑县,勃利县,永寿县,七台河市区,兴平市,龙江县,泾阳县,拜泉县,三原县,依安县,延长县,双鸭山市市区,宜川县,肇东市,黄龙县,绥化市北林区,志丹县,海伦市,黄陵县,兰西县,延川县,望奎县,青冈县,铁力市,皋兰县,嘉荫县,永登县,金塔县,阿克塞县,肃北县,肃南裕固族自治县,闽侯县,白银区,永泰县,平川区,罗源县,景泰县,连江县,通渭县,闽清县,渭源县,武平县,漳县,长汀县,甘谷县,连城县,武山县,龙岩市永定区,清水县,浦城县,张家川回族自治县,松溪县,正宁县,政和县,镇原县,光泽县,合水县,顺昌县,华池县,邵武市,环县,南平市建阳区,庆城县,福鼎市,宕昌县,古田县,成县,寿宁县,文县,周宁县,徽县,柘荣县,临夏县,屏南县,永靖县,霞浦县,广河县,福安市,康乐县,仙游县,东乡族自治县,惠安县,和政县,德化县,积石山县,永春县,合作市,安溪县,舟曲县,明溪县,碌曲县,泰宁县,玛曲县,将乐县,迭部县,宁化县,卓尼县,永安市,夏河县,尤溪县,临潭县,建宁县,清流县,海东市乐都区,大田县,永宁县,平和县,石嘴山市惠农区,云霄县,青铜峡市,长泰县,红寺堡区,南靖县,隆德县,诏安县,维吾尔自治区,华安县,乌什县,东山县,阿瓦提县,漳浦县,库车县,沙雅县,潍坊市,拜城县,新和县,林州市,青河县,内黄县,福海县,淇县,吉木乃县,温县,布尔津县,焦作市马村区,哈巴河县,焦作市山阳区,且末县,焦作市中站区,若羌县,南阳市卧龙区,和静县,南阳市宛城区,焉耆回族自治县,唐河县,和硕县,方城县,温泉县,平顶山市市郊,精河县'
        self._char_bank_name += [i+'农村信用社' for i in hezuoshe.split(',')]
        
    def predict(self, image, axis=False, model=None):
        self._show_axis = axis
        self._info = '图片模糊或非银行卡图片'
        self._error = '图片模糊或非银行卡图片'
        
        if isinstance(image, str):
            self._image = la.image.color_convert(la.image.read_image(image))
        else:
            self._image = image
        self._fit_direction(self._model if model is None else model)
        if isinstance(self._info, str):
            if self._show_axis:
                return {'data':self._info, 'axis':[], 'angle':0, 'error':self._error}
            else:
                return {'data':self._info, 'angle':0, 'error':self._error}
        self._fit_axis()
        self._fit_characters(self._axis, self._result)
        
        for aug in [0,1,2]:
            error_list = [i for i in self._info if '图片模糊' in self._info[i]]
            if error_list:
                self._result_crop = []
                for i in error_list:
                    if i not in self._axis:
                        continue
                    image = la.image.crop(self._image, self._axis[i])
                    if aug==0:
                        image = la.image.image_to_array(image)
                    elif aug==1:
                        image = la.image.image_to_array(la.image.color_convert(image, la.image.ColorMode.grayscale))[:,:,0]
                    elif aug==2:
                        image = la.image.image_to_array(la.image.enhance_brightness(image, 0.8))
                    t = (self._model if model is None else model).ocr(image, cls=False)
                    if t[0]:
                        for j in t[0]:
                            self._result_crop.append([[self._axis[i][:2], [self._axis[i][2], self._axis[i][1]], 
                                                       self._axis[i][2:], [self._axis[i][0], self._axis[i][3]]], j[1]])
                self._fit_characters(self._axis, [self._result_crop])

        self._error = '图片模糊' if [1 for i in self._info if '图片模糊' in self._info[i]] else 'ok'
        self._info = {i:('' if '图片模糊' in j else j) for i,j in self._info.items()}
        if self._show_axis:
            return {'data':self._info, 'axis':self._axis, 'angle':self._angle, 'error':self._error}
        else:
            return {'data':self._info, 'angle':self._angle, 'error':self._error}
        
    def _fit_direction(self, model):
        for angle, gray in zip([0, 0, 90, 90, 270, 270, 180, 180], [0, 1,0, 1,0, 1,0, 1]):
            image = la.image.rotate(self._image, angle, expand=True)
            if gray==1:
                image1 = la.image.image_to_array(la.image.color_convert(image, la.image.ColorMode.grayscale))[:,:,0]
            else:
                image1 = la.image.image_to_array(image)
            self._result = model.ocr(image1, cls=False)
#             print(angle, gray, self._result)
            vertical = [1 if (i[0][1][0]-i[0][0][0])>(i[0][3][1]-i[0][0][1]) else 0 for i in self._result[0] if len(la.text.sequence_preprocess(i[1][0]))>1]
            if sum(vertical)/max(len(vertical), 0.1)<0.7:
                continue
            
            text = ' '.join([i[1][0] for i in self._result[0]])
            if sum([1 for char in self._char_direction if char in text])>2:
                self._image = image
                self._angle = angle
                self._info = {i:'图片模糊' for i in self._keys if i in self._name_list}
                break
    
    def _fit_axis(self):
        if len(self._result)==0:
            return 0
        
        axis_true = dict()
        bank_number = []
        for i in self._result[0]:
            h = (i[0][3][1]+i[0][2][1]-i[0][1][1]-i[0][0][1])/2
            w = (i[0][1][0]+i[0][2][0]-i[0][0][0]-i[0][3][0])/2
            x = min(i[0][0][0], i[0][3][0])
            y = min(i[0][0][1], i[0][1][1])
            if 'bank_number' not in axis_true and len(i[1][0])>3:
                temp1 = i[1][0].replace('b', '6').replace(' ', '').replace('-', '').replace('.', '')
                temp = ''.join([char for char in temp1 if char in '0123456789'])
                if len(temp)==len(temp1) and 20>len(temp):
                    bank_number.append(([0, y-h*0.2, self._image.width, y+h*1.2], len(temp)))
                    continue
        if bank_number:
            axis_true['bank_number'] = sorted(bank_number, key=lambda x:x[1])[-1][0]
            
        self._axis = axis_true
            
    def _fit_characters(self, axis, result):
        if len(result)==0:
            return 0

        axis_true = {i:tuple(axis[i]) for i in axis}
        
        text = ' '.join([la.text.sequence_preprocess(i[1][0]) for i in self._result[0]])
#         print(text)
        if '图片模糊' in self._info.get('bank_name', ''):
            if [i for i in ['银', '行', '信用社'] if i in text]:
                score = [(char, fuzz.partial_ratio(char, text)) for char in self._char_bank_name]
    #             print(sorted(score, key=lambda x:x[1]))
                score = sorted(score, key=lambda x:x[1])[-1]
                if score[1]>=60:
                    self._info['bank_name'] = score[0]
        if '图片模糊' in self._info.get('bank_type', ''):
            if [i for i in ['借记', '记卡', '储蓄', '蓄卡'] if i in text]:
                self._info['bank_type'] = '储蓄卡'
            elif [i for i in ['信用', '用卡'] if i in text]:
                self._info['bank_type'] = '信用卡'
        
        bank_number = []
        for i in result[0]:
            h = max((i[0][3][1]+i[0][2][1]-i[0][1][1]-i[0][0][1])/2, 1)
            w = max((i[0][1][0]+i[0][2][0]-i[0][0][0]-i[0][3][0])/2, 1)
            x = min(i[0][0][0], i[0][3][0])
            y = min(i[0][0][1], i[0][1][1])
            if '图片模糊' in self._info.get('bank_number', '') and 'bank_number' in self._axis:
                h1 = min(max(i[0][3][1], i[0][2][1]), axis_true['bank_number'][3])-max(min(i[0][0][1], i[0][1][1]), axis_true['bank_number'][1])
                w1 = min(max(i[0][1][0], i[0][2][0]), axis_true['bank_number'][2])-max(min(i[0][0][0], i[0][3][0]), axis_true['bank_number'][0])            
                if h1/h>0.6 and w1/w>0.6:
                    temp = i[1][0].replace('b', '6')
                    temp = ''.join([char for char in temp if char in '0123456789'])
                    if 20>len(temp)>14:
                        if len(temp) in [15, 18]:
                            temp = '6'+temp
                        elif len(temp)==19 and temp[0] not in '469':
                            temp = '6'+temp[1:]
                    bank_number.append((temp, [x,y]+i[0][2]))
#         print(bank_number)
        if bank_number:
            if len(bank_number)==1 and len(bank_number[-1][0]) in [16,17,19]:
                self._info['bank_number'] = bank_number[-1][0]
                self._axis['bank_number'] = bank_number[-1][1]
            elif [i for i in bank_number if len(i[0]) in [16,17,19]]:
                self._info['bank_number'] = [i for i,j in bank_number if len(i) in [16,17,19]][-1]
                self._axis['bank_number'] = [j for i,j in bank_number if len(i) in [16,17,19]][-1]
            else:
                temp = sorted(bank_number, key=lambda x:x[1][0])
                if len(''.join([i[0] for i in temp])) in [16,17,19]:
                    self._info['bank_number'] = ''.join([i[0] for i in temp])
                    self._axis['bank_number'] = temp[0][1][:2]+temp[-1][1][-2:]
                
        if '图片模糊' in self._info.get('bank_type', ''):
            self._info['bank_type'] = '储蓄卡'
    
    def draw_mask(self):
        image = self._image.copy()
        try:
            t = [la.image.box_convert(self._axis[i], 'xyxy', 'axis') for i in self._axis if i in self._keys]
            if len(t)>0:
                image = la.image.draw_box(image, t, width=2)
        except:
            pass
        return image
    
